Set up Koneksi database

In [19]:
import mysql.connector
db_con = mysql.connector.connect(
  host="localhost",
  user="root",
  password="",
  database="bioskop"
)
cr = db_con.cursor()

buat fungsi query

In [20]:
def sql_query(qr):
    cr.execute(qr)
    myresult = cr.fetchall()
    for x in myresult:
        print(x)

Select semua data dari tabel kategori:

In [21]:
sql_query("SELECT * FROM kategori")

(1, 'Action')
(2, 'Drama')
(3, 'Comedy')
(4, 'Science Fiction')
(5, 'Horror')
(6, 'Romance')
(7, 'Thriller')
(8, 'Fantasy')
(9, 'Adventure')
(10, 'Mystery')

Select semua data dari tabel aktor yang lahir di "Kota 1":

In [22]:
sql_query("SELECT * FROM aktor WHERE kota_lahir = 'New York'")

Select judul dan tahun rilis dari film-film yang memiliki id_genre 2 (misalnya, aksi):

In [23]:
sql_query("SELECT judul, tahun_rilis FROM film WHERE id_genre = 2")

('Film 2', 2010)

Select nama aktor dan tahun lahirnya yang terlibat dalam film dengan judul "Film 2":

In [24]:
sql_query("SELECT nama_aktor, tahun_lahir FROM aktor WHERE id_aktor IN (SELECT id_aktor FROM aktor_membintangi WHERE id_film = (SELECT id_film FROM film WHERE judul = 'Film 2'))")

('Aktor 2', 1992)

Select judul film dan genre yang sesuai dari film yang dirilis sebelum tahun 2019:

In [25]:
sql_query("SELECT film.judul, kategori.genre FROM film JOIN kategori ON film.id_genre = kategori.id_genre WHERE film.tahun_rilis < 2019")

('Film 2', 'Drama')
('Judul Film 7 Baru', 'Action')

Select semua aktor yang tidak memiliki nilai NULL di kolom tahun_lahir:

In [26]:
sql_query("SELECT * FROM aktor WHERE tahun_lahir IS NOT NULL")

(1, 'Aktor 1', 'Kota 1', 1990)
(2, 'Aktor 2', 'Kota 2', 1992)
(3, 'Aktor 3', 'Kota 3', 1988)
(4, 'Aktor 4', 'Kota 4', 1995)
(5, 'Aktor 5', 'Kota 5', 1991)
(6, 'Aktor 6', 'Kota 6', 1993)
(7, 'Aktor 7', 'Kota 7', 1989)
(8, 'Aktor 8', 'Kota 8', 1994)
(9, 'Aktor 9', 'Kota 9', 1996)
(10, 'Aktor 10', 'Kota 10', 1997)

Select rata-rata tahun rilis dari semua film:

In [27]:
sql_query("SELECT AVG(tahun_rilis) AS rata_tahun_rilis FROM film")

(Decimal('2012.5000'),)

Select nama aktor dan judul film yang mereka bintangi:

In [28]:
sql_query("SELECT aktor.nama_aktor, film.judul FROM aktor JOIN aktor_membintangi ON aktor.id_aktor = aktor_membintangi.id_aktor JOIN film ON aktor_membintangi.id_film = film.id_film")

('Aktor 2', 'Film 2')
('Aktor 7', 'Judul Film 7 Baru')

Select jumlah film yang dirilis pada tahun 2018 untuk setiap genre:

In [29]:
sql_query("SELECT kategori.genre, COUNT(*) AS jumlah_film FROM film JOIN kategori ON film.id_genre = kategori.id_genre WHERE film.tahun_rilis = 2010 GROUP BY kategori.genre")

('Drama', 1)

Select aktor yang lahir pada tahun 1990 atau kemudian:

In [30]:
sql_query("SELECT * FROM aktor WHERE tahun_lahir >= 1990")

(1, 'Aktor 1', 'Kota 1', 1990)
(2, 'Aktor 2', 'Kota 2', 1992)
(4, 'Aktor 4', 'Kota 4', 1995)
(5, 'Aktor 5', 'Kota 5', 1991)
(6, 'Aktor 6', 'Kota 6', 1993)
(8, 'Aktor 8', 'Kota 8', 1994)
(9, 'Aktor 9', 'Kota 9', 1996)
(10, 'Aktor 10', 'Kota 10', 1997)